Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 81)           0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 2)            0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           5248        input_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           96          input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 96)           0           dense_1[0][0]                    
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           6208        concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 4)            260         dense_3[0][0]                    
==================================================================================================
Total params: 11,812
Trainable params: 11,812
Non-trainable params: 0
__________________________________________________________________________________________________
